trade_exp/src/Documents/ЛистСогласованияДоговоров/ЛистСогласованияДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5465303e-6a9f-4648-837b-310b313bafa5">
  <name>ЛистСогласованияДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="4e296f2b-e0ba-454d-aac8-1f65315ec996">
    <name>ДатаИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="31aa3de0-8430-4b84-9c90-52b6ad0caff1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="52d4f25b-40bf-4e13-b5ca-eb2b47c6b4d6">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="69818d83-46a0-4532-9108-787781ac90e2">
    <name>Исполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0da6cbf-5c20-4107-951f-90cf76af559f">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8f5ca3a-2207-4b89-a57e-f7b6e4b07cca">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8fa64294-c305-4285-88be-0994f6cabd05">
    <name>ДатаРегистрацииИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45fed746-4a02-494a-b049-29396ed9fba5">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="466595ab-d0c3-4713-b2db-4c020485cfe3">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6cb53c89-a54b-4353-bc78-d492718327cb">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="636c29f5-e278-4a05-b584-42192de3e827">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/ЛистСогласованияДоговоров/Forms/ФормаСписка/Module.bsl
//Отборы
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));
КонецПроцедуры

&НаКлиенте
Процедура ОтборОсновнойМенеджерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ОсновнойМенеджер", ОтборОсновнойМенеджер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОсновнойМенеджер));
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Автор", ОтборАвтор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборАвтор));
КонецПроцедуры

&НаКлиенте
Процедура ОтборИсполненПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Исполнен", ОтборИсполнен, ВидСравненияКомпоновкиДанных.Равно,, ОтборИсполнен);
КонецПроцедуры
//Отборы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Параметры.Свойство("Основание") Тогда
		Если ЗначениеЗаполнено(Параметры.Основание) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Основание", Параметры.Основание, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Параметры.Основание));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
